[
  {
    "image": "https://images.unsplash.com/photo-1611162617474-5b21e879e113?w=400",
    "title": "FitTrack Pro",
    "companyName": "HealthTech Solutions",
    "id": 1001,
    "description": "Transform your fitness journey with FitTrack Pro, the ultimate companion for achieving your health goals. This comprehensive fitness application provides personalized workout plans, detailed nutrition tracking, and real-time progress monitoring. With advanced AI-powered recommendations, you'll receive customized exercise routines tailored to your fitness level, body type, and goals. Track calories, macronutrients, water intake, and sleep patterns all in one place while connecting with a supportive community of fitness enthusiasts.A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere. ",
    "size": 45.2,
    "reviews": 125430,
    "ratingAvg": 4.7,
    "downloads": "5M",
    "ratings": [
      {
        "name": "1 star",
        "count": 3200
      },
      {
        "name": "2 star",
        "count": 5800
      },
      {
        "name": "3 star",
        "count": 12400
      },
      {
        "name": "4 star",
        "count": 38500
      },
      {
        "name": "5 star",
        "count": 65530
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1551650975-87deedd944c3?w=400",
    "title": "MindSpace Meditation",
    "companyName": "Zen Digital Inc",
    "id": 1002,
    "description": "Discover inner peace and mental clarity with MindSpace Meditation, your personal guide to mindfulness and relaxation. This beautifully designed app offers hundreds of guided meditation sessions ranging from 3 to 60 minutes, perfect for beginners and experienced practitioners alike. Features include breathing exercises, sleep stories narrated by soothing voices, ambient soundscapes, and progress tracking to help you build a consistent meditation habit. Reduce stress, improve focus, and enhance your overall well-being with scientifically-backed meditation techniques. This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 38.7,
    "reviews": 89234,
    "ratingAvg": 4.8,
    "downloads": "4M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1800
      },
      {
        "name": "2 star",
        "count": 3200
      },
      {
        "name": "3 star",
        "count": 8900
      },
      {
        "name": "4 star",
        "count": 28500
      },
      {
        "name": "5 star",
        "count": 46834
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1563986768609-322da13575f3?w=400",
    "title": "BudgetMaster Plus",
    "companyName": "FinWise Technologies",
    "id": 1003,
    "description": "Take control of your financial future with BudgetMaster Plus, the intelligent money management solution trusted by millions worldwide. This powerful budgeting app automatically categorizes your expenses, tracks spending patterns, and provides actionable insights to help you save more money. Set custom budgets for different categories, receive alerts when approaching limits, and visualize your financial health through intuitive charts and graphs. Connect multiple bank accounts securely, plan for major purchases, and achieve your savings goals faster with smart recommendations. For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 52.4,
    "reviews": 156789,
    "ratingAvg": 4.6,
    "downloads": 7230000,
    "ratings": [
      {
        "name": "1 star",
        "count": 4500
      },
      {
        "name": "2 star",
        "count": 7800
      },
      {
        "name": "3 star",
        "count": 18900
      },
      {
        "name": "4 star",
        "count": 52300
      },
      {
        "name": "5 star",
        "count": 73289
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1516321318423-f06f85e504b3?w=400",
    "title": "LinguaLearn",
    "companyName": "Global Education Group",
    "id": 1004,
    "description": "Master any language with LinguaLearn, the revolutionary language learning platform that makes education fun and effective. Using scientifically-proven spaced repetition techniques and gamification elements, you'll build vocabulary, improve pronunciation, and gain conversational confidence in over 30 languages. Interactive lessons adapt to your learning pace, while speech recognition technology provides instant feedback on your pronunciation. Engage with native speakers through built-in chat features, complete daily challenges, and track your progress with detailed analytics showing your improvement over time.This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 67.8,
    "reviews": 234567,
    "ratingAvg": 4.9,
    "downloads": "6M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2300
      },
      {
        "name": "2 star",
        "count": 4100
      },
      {
        "name": "3 star",
        "count": 11600
      },
      {
        "name": "4 star",
        "count": 68900
      },
      {
        "name": "5 star",
        "count": 147667
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?w=400",
    "title": "PhotoPro Studio",
    "companyName": "Creative Labs Digital",
    "id": 1005,
    "description": "Unleash your creativity with PhotoPro Studio, the professional-grade photo editing application that brings desktop-quality tools to your mobile device. Whether you're a beginner or professional photographer, this feature-rich app provides everything you need to create stunning images. Access powerful editing tools including curves, selective adjustments, healing brush, and advanced color grading options. Apply artistic filters, remove unwanted objects seamlessly, add text and graphics, and export in multiple formats including RAW. With non-destructive editing and layer support, your creative possibilities are endless. A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere. ",
    "size": 94.3,
    "reviews": 178945,
    "ratingAvg": 4.5,
    "downloads": "8M",
    "ratings": [
      {
        "name": "1 star",
        "count": 6700
      },
      {
        "name": "2 star",
        "count": 9800
      },
      {
        "name": "3 star",
        "count": 21500
      },
      {
        "name": "4 star",
        "count": 62400
      },
      {
        "name": "5 star",
        "count": 78545
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1484480974693-6ca0a78fb36b?w=400",
    "title": "TaskFlow Manager",
    "companyName": "Productivity Pro Systems",
    "id": 1006,
    "description": "Maximize your productivity and never miss a deadline with TaskFlow Manager, the intelligent task management solution designed for busy professionals and teams. This comprehensive app combines to-do lists, project management, calendar integration, and collaboration tools in one seamless platform. Create tasks with multiple priority levels, set recurring reminders, attach files and notes, and organize projects with customizable boards and lists. Real-time synchronization across all devices ensures you stay updated wherever you are, while powerful analytics help you identify productivity patterns and optimize your workflow. For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 41.6,
    "reviews": 145678,
    "ratingAvg": 4.7,
    "downloads": "17M",
    "ratings": [
      {
        "name": "1 star",
        "count": 3500
      },
      {
        "name": "2 star",
        "count": 5900
      },
      {
        "name": "3 star",
        "count": 14600
      },
      {
        "name": "4 star",
        "count": 48900
      },
      {
        "name": "5 star",
        "count": 72778
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1505751172876-fa1923c5c528?w=400",
    "title": "RecipeBox Deluxe",
    "companyName": "Culinary Digital Solutions",
    "id": 1007,
    "description": "Transform your cooking experience with RecipeBox Deluxe, the ultimate culinary companion featuring thousands of delicious recipes from around the world. Whether you're planning weeknight dinners or hosting elegant dinner parties, this app provides step-by-step instructions, ingredient lists with smart shopping cart features, and nutritional information for every dish. Filter recipes by dietary preferences, cooking time, difficulty level, and available ingredients. Save your favorites, create custom meal plans, adjust serving sizes automatically, and share your culinary creations with a vibrant community of food enthusiasts. This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 73.2,
    "reviews": 198765,
    "ratingAvg": 4.8,
    "downloads": "9M",
    "ratings": [
      {
        "name": "1 star",
        "count": 3200
      },
      {
        "name": "2 star",
        "count": 5800
      },
      {
        "name": "3 star",
        "count": 15900
      },
      {
        "name": "4 star",
        "count": 64200
      },
      {
        "name": "5 star",
        "count": 109665
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1551650975-87deedd944c3?w=400",
    "title": "WeatherWise Plus",
    "companyName": "MeteoTech International",
    "id": 1008,
    "description": "Stay ahead of the weather with WeatherWise Plus, the most accurate and comprehensive weather forecasting app available today. Powered by advanced meteorological models and real-time data from thousands of weather stations, this app provides hyper-local forecasts with minute-by-minute precipitation predictions. Access detailed hourly and 15-day forecasts, severe weather alerts, interactive radar maps, and customizable widgets for your home screen. Track multiple locations simultaneously, receive notifications for specific weather conditions, and plan your activities with confidence using our reliable weather predictions backed by cutting-edge technology. A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere.",
    "size": 55.9,
    "reviews": 267890,
    "ratingAvg": 4.6,
    "downloads": "10M",
    "ratings": [
      {
        "name": "1 star",
        "count": 8900
      },
      {
        "name": "2 star",
        "count": 12300
      },
      {
        "name": "3 star",
        "count": 26700
      },
      {
        "name": "4 star",
        "count": 89400
      },
      {
        "name": "5 star",
        "count": 130590
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1551817958-11e0f7bbea4e?w=400",
    "title": "SleepTracker Premium",
    "companyName": "HealthSync Technologies",
    "id": 1009,
    "description": "Improve your sleep quality and wake up refreshed with SleepTracker Premium, the scientifically-designed sleep analysis and improvement application. Using advanced algorithms and your device's sensors, this app monitors your sleep cycles, detects snoring and sleep disturbances, and provides personalized recommendations for better rest. Set smart alarms that wake you during light sleep phases, listen to curated soundscapes designed to promote deep sleep, and track factors affecting your sleep quality including caffeine intake, exercise, and stress levels. Comprehensive sleep reports help you understand patterns and make lifestyle adjustments. For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 48.7,
    "reviews": 134567,
    "ratingAvg": 4.7,
    "downloads": "3M",
    "ratings": [
      {
        "name": "1 star",
        "count": 3400
      },
      {
        "name": "2 star",
        "count": 5100
      },
      {
        "name": "3 star",
        "count": 13500
      },
      {
        "name": "4 star",
        "count": 45900
      },
      {
        "name": "5 star",
        "count": 66667
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?w=400",
    "title": "HomeWorkout Coach",
    "companyName": "FitLife Digital",
    "id": 1010,
    "description": "Achieve your fitness goals from the comfort of your home with HomeWorkout Coach, the personal training app that brings expert guidance to your living room. No equipment necessary – this app offers hundreds of bodyweight exercises and workout routines designed by certified fitness trainers. Choose from various programs including fat burning, muscle building, flexibility improvement, and beginner-friendly options. Each exercise includes detailed video demonstrations, proper form instructions, and modifications for different fitness levels. Track your workout history, calories burned, and progress photos while staying motivated with achievement badges and daily challenges. This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 62.1,
    "reviews": 189234,
    "ratingAvg": 4.8,
    "downloads": "20M",
    "ratings": [
      {
        "name": "1 star",
        "count": 3700
      },
      {
        "name": "2 star",
        "count": 5600
      },
      {
        "name": "3 star",
        "count": 14800
      },
      {
        "name": "4 star",
        "count": 62500
      },
      {
        "name": "5 star",
        "count": 102634
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1517694712202-14dd9538aa97?w=400",
    "title": "CodeMaster Academy",
    "companyName": "TechEdu Solutions",
    "id": 1011,
    "description": "Launch your programming career with CodeMaster Academy, the comprehensive coding education platform that teaches you to code through interactive lessons and real-world projects. Learn popular programming languages including Python, JavaScript, Java, C++, and more with bite-sized lessons that fit your schedule. Each course includes hands-on coding challenges, quizzes to test your knowledge, and portfolio projects to showcase your skills. Get instant feedback on your code, track your learning progress, and earn certificates upon completion. Whether you're a complete beginner or looking to advance your skills, our structured curriculum adapts to your learning pace. A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere.",
    "size": 86.4,
    "reviews": 145890,
    "ratingAvg": 4.9,
    "downloads": "4.5M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1900
      },
      {
        "name": "2 star",
        "count": 3100
      },
      {
        "name": "3 star",
        "count": 9200
      },
      {
        "name": "4 star",
        "count": 47800
      },
      {
        "name": "5 star",
        "count": 83890
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1493612276216-ee3925520721?w=400",
    "title": "TravelPlan Navigator",
    "companyName": "Wanderlust Technologies",
    "id": 1012,
    "description": "Plan unforgettable adventures with TravelPlan Navigator, the all-in-one travel planning and booking application that makes trip organization effortless. Discover amazing destinations with curated travel guides, create detailed itineraries with day-by-day activities, and book flights, hotels, and tours directly through the app. Access offline maps, save important documents like tickets and reservations in one place, and get real-time flight updates and gate changes. Share your travel plans with companions, split expenses with integrated cost tracking, and discover hidden gems recommended by fellow travelers and local experts in our community. For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 79.5,
    "reviews": 223456,
    "ratingAvg": 4.7,
    "downloads": "7M",
    "ratings": [
      {
        "name": "1 star",
        "count": 5600
      },
      {
        "name": "2 star",
        "count": 8900
      },
      {
        "name": "3 star",
        "count": 22300
      },
      {
        "name": "4 star",
        "count": 78400
      },
      {
        "name": "5 star",
        "count": 108256
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1494253109108-2e30c049369b?w=400",
    "title": "PetCare Companion",
    "companyName": "Animal Wellness Apps",
    "id": 1013,
    "description": "Give your furry friends the best care possible with PetCare Companion, the comprehensive pet management app designed for responsible pet owners. Track vaccination schedules, medication reminders, vet appointments, and health records for multiple pets in one convenient location. Access a database of pet-safe foods, emergency first aid instructions, and nearby veterinary clinics with ratings and reviews. Set feeding schedules, monitor weight changes, and log activities to ensure your pets stay healthy and happy. Connect with other pet owners, share adorable photos, and get expert advice from certified veterinarians through our consultation feature. This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 44.8,
    "reviews": 167890,
    "ratingAvg": 4.8,
    "downloads": "26M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2900
      },
      {
        "name": "2 star",
        "count": 4700
      },
      {
        "name": "3 star",
        "count": 15100
      },
      {
        "name": "4 star",
        "count": 57400
      },
      {
        "name": "5 star",
        "count": 87790
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?w=400",
    "title": "MusicStream Pro",
    "companyName": "SoundWave Entertainment",
    "id": 1014,
    "description": "Experience music like never before with MusicStream Pro, the premium streaming service offering unlimited access to millions of songs across all genres. Enjoy high-fidelity audio quality, create unlimited playlists, and discover new artists through our intelligent recommendation algorithm that learns your preferences. Download songs for offline listening, view synchronized lyrics, and explore curated playlists created by music experts and celebrities. Access exclusive live performances, podcasts, and artist interviews. With seamless integration across all your devices and family sharing options, your perfect soundtrack is always at your fingertips wherever you go.A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere.",
    "size": 71.3,
    "reviews": 456789,
    "ratingAvg": 4.6,
    "downloads": "10M",
    "ratings": [
      {
        "name": "1 star",
        "count": 15600
      },
      {
        "name": "2 star",
        "count": 22800
      },
      {
        "name": "3 star",
        "count": 45700
      },
      {
        "name": "4 star",
        "count": 156900
      },
      {
        "name": "5 star",
        "count": 215789
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1557683316-973673baf926?w=400",
    "title": "ShopSmart Deals",
    "companyName": "RetailTech Innovations",
    "id": 1015,
    "description": "Save money on every purchase with ShopSmart Deals, the intelligent shopping assistant that finds the best prices, coupons, and cashback opportunities automatically. Simply scan product barcodes or search for items to compare prices across thousands of online and local retailers instantly. Receive price drop alerts on products you're watching, access exclusive discount codes, and earn cashback rewards on eligible purchases. Create shopping lists, track expenses by category, and discover trending products with verified customer reviews. Our browser extension automatically applies the best available coupons at checkout, ensuring you never overpay again.For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 53.7,
    "reviews": 289345,
    "ratingAvg": 4.5,
    "downloads": "16M",
    "ratings": [
      {
        "name": "1 star",
        "count": 10300
      },
      {
        "name": "2 star",
        "count": 14600
      },
      {
        "name": "3 star",
        "count": 34700
      },
      {
        "name": "4 star",
        "count": 102400
      },
      {
        "name": "5 star",
        "count": 127345
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1611162618071-b39a2ec055fb?w=400",
    "title": "GardenGuru Planner",
    "companyName": "GreenThumb Technologies",
    "id": 1016,
    "description": "Cultivate your dream garden with GardenGuru Planner, the essential gardening app for beginners and experienced gardeners alike. Identify plants instantly using photo recognition technology, receive personalized care instructions based on your location and climate, and get timely reminders for watering, fertilizing, and pruning. Access a comprehensive database of thousands of plants with detailed growing guides, pest identification and treatment options, and companion planting recommendations. Design your garden layout with our interactive planning tool, track growth progress with photo journals, and connect with a community of passionate gardeners sharing tips and inspiration.This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 68.9,
    "reviews": 112345,
    "ratingAvg": 4.7,
    "downloads": "28M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2800
      },
      {
        "name": "2 star",
        "count": 4200
      },
      {
        "name": "3 star",
        "count": 11200
      },
      {
        "name": "4 star",
        "count": 38900
      },
      {
        "name": "5 star",
        "count": 55245
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1551650975-87deedd944c3?w=400",
    "title": "NewsHub 360",
    "companyName": "Global Media Network",
    "id": 1017,
    "description": "Stay informed with NewsHub 360, the comprehensive news aggregation platform that delivers personalized news from trusted sources worldwide. Customize your news feed by selecting topics, regions, and preferred publishers to create a tailored information experience. Read articles from multiple perspectives to get balanced coverage of important events, save articles for later reading, and access offline mode for commutes. Breaking news alerts keep you updated on developing stories, while our ad-free reading mode provides distraction-free consumption of content. With built-in translation for international news and audio summaries for busy lifestyles, staying informed has never been easier.A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere.",
    "size": 49.2,
    "reviews": 234890,
    "ratingAvg": 4.6,
    "downloads": "30M",
    "ratings": [
      {
        "name": "1 star",
        "count": 7800
      },
      {
        "name": "2 star",
        "count": 11200
      },
      {
        "name": "3 star",
        "count": 28900
      },
      {
        "name": "4 star",
        "count": 84600
      },
      {
        "name": "5 star",
        "count": 102390
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?w=400",
    "title": "YogaFlow Daily",
    "companyName": "Mindful Movement Studios",
    "id": 1018,
    "description": "Transform your body and mind with YogaFlow Daily, the comprehensive yoga instruction app featuring classes for every skill level and lifestyle. Access hundreds of professionally filmed yoga sessions ranging from gentle morning flows to intense power yoga workouts, each with clear instructions from certified instructors. Choose classes by duration, style, focus area, or difficulty level to match your needs perfectly. Follow structured programs for specific goals like flexibility, strength building, or stress relief. Track your practice with statistics and achievements, learn proper alignment with detailed pose libraries, and meditate with guided sessions designed to complement your physical practice. For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 77.6,
    "reviews": 176543,
    "ratingAvg": 4.9,
    "downloads": "35M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2100
      },
      {
        "name": "2 star",
        "count": 3400
      },
      {
        "name": "3 star",
        "count": 10900
      },
      {
        "name": "4 star",
        "count": 56800
      },
      {
        "name": "5 star",
        "count": 103343
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1551650975-87deedd944c3?w=400",
    "title": "CloudDrive Storage",
    "companyName": "SecureData Systems",
    "id": 1019,
    "description": "Protect and access your important files anywhere with CloudDrive Storage, the secure cloud storage solution trusted by millions worldwide. Upload photos, videos, documents, and any file type with automatic backup from your devices. Share files and folders with customizable permissions, collaborate on documents in real-time, and access your content from any device with internet connection. Advanced encryption ensures your data stays private and protected, while version history lets you recover previous file versions. Generous storage space, fast upload and download speeds, and seamless integration with popular productivity apps make CloudDrive the ultimate file management solution.This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 58.4,
    "reviews": 345678,
    "ratingAvg": 4.7,
    "downloads": "1M",
    "ratings": [
      {
        "name": "1 star",
        "count": 9800
      },
      {
        "name": "2 star",
        "count": 14200
      },
      {
        "name": "3 star",
        "count": 34600
      },
      {
        "name": "4 star",
        "count": 120500
      },
      {
        "name": "5 star",
        "count": 166578
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?w=400",
    "title": "DrawMaster Artist",
    "companyName": "Creative Arts Digital",
    "id": 1020,
    "description": "Unleash your artistic potential with DrawMaster Artist, the professional digital drawing and painting application designed for artists of all levels. Create stunning artwork using realistic brushes, pencils, markers, and painting tools that simulate traditional media with remarkable accuracy. Layer support, blend modes, and adjustment tools give you complete creative control, while pressure sensitivity support works seamlessly with stylus devices. Access extensive color palettes, import reference images, and use symmetry tools for precise work. Export your creations in high resolution for printing or sharing. Join a vibrant community of artists sharing techniques, participating in challenges, and providing constructive feedback.A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere.",
    "size": 103.7,
    "reviews": 198765,
    "ratingAvg": 4.8,
    "downloads": "2M",
    "ratings": [
      {
        "name": "1 star",
        "count": 3900
      },
      {
        "name": "2 star",
        "count": 6200
      },
      {
        "name": "3 star",
        "count": 17800
      },
      {
        "name": "4 star",
        "count": 68400
      },
      {
        "name": "5 star",
        "count": 102465
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1551817958-11e0f7bbea4e?w=400",
    "title": "VoiceRecord Pro",
    "companyName": "AudioTech Solutions",
    "id": 1021,
    "description": "Capture crystal-clear audio recordings with VoiceRecord Pro, the professional-quality recording app perfect for meetings, lectures, interviews, music, and personal notes. Advanced audio processing technology reduces background noise and optimizes voice clarity automatically, ensuring every recording is perfectly audible. Organize recordings with tags, folders, and favorites, add text notes and bookmarks to specific timestamps, and share audio files in multiple formats. Transcription features convert speech to text with impressive accuracy, supporting multiple languages. Cloud backup protects your important recordings, while editing tools let you trim, merge, and enhance audio with professional effects and filters.For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 46.3,
    "reviews": 167234,
    "ratingAvg": 4.6,
    "downloads": "24M",
    "ratings": [
      {
        "name": "1 star",
        "count": 5100
      },
      {
        "name": "2 star",
        "count": 7800
      },
      {
        "name": "3 star",
        "count": 18900
      },
      {
        "name": "4 star",
        "count": 61200
      },
      {
        "name": "5 star",
        "count": 74234
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1517694712202-14dd9538aa97?w=400",
    "title": "CalorieCount Tracker",
    "companyName": "NutritionTech Labs",
    "id": 1022,
    "description": "Achieve your nutrition goals with CalorieCount Tracker, the most comprehensive food logging and nutrition analysis application available. Track meals effortlessly using our extensive database of over 2 million foods, barcode scanner for packaged items, and photo recognition that identifies foods and estimates portions. Monitor calories, macronutrients, vitamins, and minerals with detailed breakdowns and visual charts. Set personalized daily goals based on your age, weight, activity level, and objectives. Log water intake, create custom recipes with automatic nutrition calculation, and sync with fitness apps to account for exercise. Expert meal suggestions and nutritional insights help you make informed dietary choices.This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest.",
    "size": 64.8,
    "reviews": 289123,
    "ratingAvg": 4.7,
    "downloads": "19M",
    "ratings": [
      {
        "name": "1 star",
        "count": 7200
      },
      {
        "name": "2 star",
        "count": 10900
      },
      {
        "name": "3 star",
        "count": 28900
      },
      {
        "name": "4 star",
        "count": 98700
      },
      {
        "name": "5 star",
        "count": 143423
      }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?w=400",
    "title": "BikeRoute Navigator",
    "companyName": "CycleMap Technologies",
    "id": 1023,
    "description": "Discover the best cycling routes with BikeRoute Navigator, the ultimate app for cyclists featuring detailed maps, route planning, and performance tracking. Find bike-friendly paths in your area with elevation profiles, surface types, and difficulty ratings to match your skill level. Plan custom routes with turn-by-turn voice navigation, avoiding busy roads and steep hills if preferred. Track your rides with comprehensive statistics including distance, speed, elevation gain, and calories burned. Join cycling challenges, compete on popular segments, and share your adventures with a community of cycling enthusiasts. Weather forecasts and safety features ensure enjoyable rides every time.A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere.",
    "size": 72.9,
    "reviews": 143567,
    "ratingAvg": 4.8,
    "downloads": "20M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2800
      },
      {
        "name": "2 star",
        "count": 4300
      },
      {
        "name": "3 star",
        "count": 14200
      },
      {
        "name": "4 star",
        "count": 51400
      },
      {
        "name": "5 star",
        "count": 70867
      }
    ]
  }
]
